{
    "version": "https://jsonfeed.org/version/1",
    "title": "Thomas Fowles",
    "description": "",
    "home_page_url": "https://blog.thomasfowles.com",
    "feed_url": "https://blog.thomasfowles.com/feed.json",
    "user_comment": "",
    "author": {
        "name": "Thomas Fowles"
    },
    "items": [
        {
            "id": "https://blog.thomasfowles.com/source-controlled-publii-blog/",
            "url": "https://blog.thomasfowles.com/source-controlled-publii-blog/",
            "title": "Source-Controlled Publii Blog",
            "summary": "Enabling Full Collaboration with GitI always have projects floating through my mind. There are so many cool things to explore&hellip;",
            "content_html": "<h2 class=\"align-center\">Enabling Full Collaboration with Git</h2>\n<p>I always have projects floating through my mind. There are so many cool things to explore and build, but so little time. I'm sure many of you reading can sympathize with me on this.</p>\n<p>It seems that I am drawn towards displaying these projects via the web. It makes sense; its the best way to get eyeballs on what you are doing. I learning decades ago how to use notepad to build a website. And with each project, it seems I wanted something more sophisticated. From Dreamweaver, to WordPress, to an AWS website - it always got bigger. But lately I've found that simple is better. The idea: focus on the content, not the technology. </p>\n<p>With this in mind, I found out about Publii. <a href=\"https://getpublii.com/\" target=\"_blank\" rel=\"noopener noreferrer\">Publii </a>is a static CMS with a desktop GUI that helps build websites fast. I instantly loved the idea. You download Publii, setup a few settings, change some theme colors and configurations, and get to work writing great content. Even better, Publii integrates with a number of free hosting services. Instead of forking over money to host your blog, you can make it completely free! What a win.</p>\n<p>But I did have a use case it had to fulfill - I wanted it be collaborative.</p>\n<p>I don't have any friends helping me with this blog (for now, at least). But as all my projects go, I'm always thinking about the future. Scaling. Bigger. Better. And I needed to be able to collaborate if that was going to happen. I had a vision - a team member adds content to the blog, creates a pull request, and then other team members can review the pull request and help merge it to the website. Using git's collaboration tooling seemed like a great way to go, especially when I am already hosting the website on Github.</p>\n<p>I started to dig around for an answer. While searching the web, I found <a href=\"https://getpublii.com/docs/publii-on-multiple-computers-via-dropbox.html\" target=\"_blank\" rel=\"noopener noreferrer\">this page detailing how to access your blog from a second computer</a>. It described how the blog content could be stored in dropbox and shared between multiple users or computers. Great. This somewhat works, but doesn't have the built-in pipeline I was looking for. </p>\n<p>I started to play around with this, and found a solution that seems to work ok. If you are looking for a solution to this, I hope this is the silver bullet you are looking for, and your google searching is over.</p>\n<h3>Setting up your blog with Github</h3>\n<p>Below are a few processes that you can follow to get Publii working within a git repository. Here are some of the pre-requisites you may want/need to install and setup on your machine:</p>\n<ul>\n<li><a href=\"https://getpublii.com/download/\" target=\"_blank\" rel=\"noopener noreferrer\">Publii Desktop</a></li>\n<li><a href=\"https://git-scm.com/downloads\" target=\"_blank\" rel=\"noopener noreferrer\">git </a>(or <a href=\"https://desktop.github.com/\" target=\"_blank\" rel=\"noopener noreferrer\">Github Desktop</a>)</li>\n<li>A <a href=\"https://github.com/\" target=\"_blank\" rel=\"noopener noreferrer\">Github account </a></li>\n</ul>\n<p>Just thought I would give you the heads up to download these things before you can finish all of the steps below.</p>\n<h4>Publii Project Folder</h4>\n<p>To start, we are going to open Publii and create a new website.</p>\n<ol>\n<li>Establish where your github repos will live on your computer.<br><strong>Example</strong>: I use Github desktop. My default location is C:\\Users\\thoma\\source\\repos. You don't have to use this location, but it will be more convenient if you have multiple Publii sites.</li>\n<li>Create a <em>Publii</em> folder in your repos folder</li>\n<li>Open Publii Desktop</li>\n<li>Click the settings button (top right) &gt; App settings</li>\n<li>Navigate to Files location &gt; Sites Location<br><figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://blog.thomasfowles.com/media/posts/3/Publii-Files-Locations.png\" sizes=\"(max-width: 48em) 100vw, 100vw\" srcset=\"https://blog.thomasfowles.com/media/posts/3/responsive/Publii-Files-Locations-xs.png 300w ,https://blog.thomasfowles.com/media/posts/3/responsive/Publii-Files-Locations-sm.png 480w ,https://blog.thomasfowles.com/media/posts/3/responsive/Publii-Files-Locations-md.png 768w\"  alt=\"\" width=\"988\" height=\"707\"></figure></li>\n<li>Update the sites location value to be the <em>Publii</em> folder created in step 2</li>\n<li>Save the changes. You may need to close Publii and open it again</li>\n</ol>\n<p>Any existing project will be moved to the new Publii folder and should continue to work as normal.</p>\n<h4>Setup a Github Repository</h4>\n<p>Note: This step assumes that you have used Publii to create a new site. If you haven't done so, create a site on Publii (even if it doesn't have any posts or settings configured).</p>\n<ol>\n<li>Open your web browser and go to <a href=\"https://github.com/\" target=\"_blank\" rel=\"noopener noreferrer\">Github</a>. Create a new empty repository.<br><strong>Note</strong>: This repository should be set to private. If you are using free themes, then using a public repository could be fine. I still set mine up as private, as I may want to add purchased content to my site in the future.</li>\n<li>Copy the repo url<br><figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://blog.thomasfowles.com/media/posts/3/Publii-Github-Repository-Url.png\" sizes=\"(max-width: 48em) 100vw, 100vw\" srcset=\"https://blog.thomasfowles.com/media/posts/3/responsive/Publii-Github-Repository-Url-xs.png 300w ,https://blog.thomasfowles.com/media/posts/3/responsive/Publii-Github-Repository-Url-sm.png 480w ,https://blog.thomasfowles.com/media/posts/3/responsive/Publii-Github-Repository-Url-md.png 768w\"  alt=\"\" width=\"927\" height=\"425\"></figure></li>\n<li>Open CMD or Powershell (if on Windows). Navigate to your project folder</li>\n<li>Execute the following commands:\n<pre>git init<br>git commit -m \"&lt;some commit message&gt;\"<br>git remote add origin &lt;github repo url&gt;<br>git push -u origin master</pre>\n</li>\n</ol>\n<p>If you struggle with setting up a repo, I have found <a href=\"https://kbroman.org/github_tutorial/pages/init.html\" target=\"_blank\" rel=\"noopener noreferrer\">this explanation by Karl Broman to be helpful</a>. </p>\n<h4>Publii Server Setup</h4>\n<p>The prior steps have integrated our site with a github repository. Unfortunately Publii has a cool feature that allows it to publish to Github (or Gitlab or Netlify) automatically. This is a cool feature, but it can also break our repository system. We don't want to allow some user to accidentally override our repository contents (which will happen if someone clicks the <strong>Sync my Website</strong> button). We need to prevent this.</p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://blog.thomasfowles.com/media/posts/3/Publii-Github-Server.png\" sizes=\"(max-width: 48em) 100vw, 100vw\" srcset=\"https://blog.thomasfowles.com/media/posts/3/responsive/Publii-Github-Server-xs.png 300w ,https://blog.thomasfowles.com/media/posts/3/responsive/Publii-Github-Server-sm.png 480w ,https://blog.thomasfowles.com/media/posts/3/responsive/Publii-Github-Server-md.png 768w\"  alt=\"\" width=\"919\" height=\"856\"></figure>\n<p>We need to have some of this information populated so a couple of networking files and values are populated. You can use the above as a template. Essentially, I gave the expected values in all fields except for <em>Branch<strong> </strong></em>and <em>Token</em>. This way the configurations are correct but a connection is unable to be created.</p>\n<h4>Pushing Changes to Github</h4>\n<p>Phew. That took a bit of effort. But if you are comfortable with git, this setup should feel pretty familiar. Let's look at the last major piece to the puzzle - pushing our changes to Github.</p>\n<p>To get this working properly, you may need to change some of your habits while using Publii. It is important to understand two Publii concepts:</p>\n<p><strong>Preview</strong> - Publii has a preview folder that allows authors to view blog posts in progress. When authoring a post, an author can click the <em>Preview</em> button in the top left corner. Publii then generates the page and opens an internal browser window and displays the page. This isn't the website; this is only used for convenience for the author.</p>\n<p><strong>Output</strong> - The output folder in Publii is the actual website. Whatever shows up in the output folder will be pushed to Github pages (or whatever host you choose). It is vital that this folder contains all of your posts, files, etc.</p>\n<p>The secret? When you are ready to push your changes to Github, <strong>you must sync your website</strong>. This will re-generate and overwrite the contents of the Output folder. Based on what we did above, the output folder will generate properly, but the push to Github will fail. To get your changes to Github, you will need to follow standard git flows (e.g. Create a branch + pull request, push to origin, etc.)</p>\n<h3>Displaying the Website</h3>\n<p>The above allowed me to get my website content up and allowed me to collaborate (if I had friends). It didn't display my website. My private repository is not setup to work with <a href=\"https://pages.github.com/\">Github pages</a>. (You can have a private repository work with Github pages, but you need a paid account for that).</p>\n<p>There are two ways to get our content working with Github pages. Both require the use of <a href=\"https://github.com/features/actions\" target=\"_blank\" rel=\"noopener noreferrer\">Github actions</a>.</p>\n<h4>Single Repository Setup</h4>\n<p>Github pages allows for some configuration for setting up the website home directory, but it is pretty limited. We need the contents of our <strong>Output </strong>folder to be placed in a separate branch, or we need to put them in a <strong>docs</strong> folder at the root of the repository. I would suggest using a docs folder, as that would fit inline with most git workflows.</p>\n<p>I won't go into too much depth on Github actions, but essentially we can setup trigger events to start our defined actions. For this setup, I would suggest that every time something is committed to master (i.e. merged) that the action kick off. The action is simple: copy the contents of the Output folder to the docs folder. It is important that the two folders match exactly.</p>\n<p>Luckily actions can be shared in the github marketplace. I haven't tried any of these solutions, but here are a few I found with a quick Google search:</p>\n<ul>\n<li><a href=\"https://github.com/marketplace/actions/github-pages\">https://github.com/marketplace/actions/github-pages</a></li>\n<li><a href=\"https://github.com/marketplace/actions/github-pages-action\">https://github.com/marketplace/actions/github-pages-action</a></li>\n<li><a href=\"https://github.com/marketplace/actions/deploy-to-github-pages\">https://github.com/marketplace/actions/deploy-to-github-pages</a></li>\n</ul>\n<p>And I'm sure there are plenty more. Make sure to vet them and do additional research before just pulling one down and using it!</p>\n<h4>Dual Repository Setup</h4>\n<p>This is how I setup my website. I preferred this method, as it keeps my publii files away from the public. It also makes my website repository much simpler, as it only includes web files.</p>\n<p>To get this working, we will need to complete a few more steps.</p>\n<h5>Setup the Public Repository</h5>\n<p>Github pages won't run in a private repository (unless you have a paid account). This repository doesn't have to be public, but mine is. Go to github and setup this second repository. Be sure to go to the settings and select that you do want to use Github pages (see image below).</p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://blog.thomasfowles.com/media/posts/3/Github-Pages.png\" sizes=\"(max-width: 48em) 100vw, 100vw\" srcset=\"https://blog.thomasfowles.com/media/posts/3/responsive/Github-Pages-xs.png 300w ,https://blog.thomasfowles.com/media/posts/3/responsive/Github-Pages-sm.png 480w ,https://blog.thomasfowles.com/media/posts/3/responsive/Github-Pages-md.png 768w\"  alt=\"\" width=\"917\" height=\"511\"></figure>\n<h5>Establish Repository Secrets</h5>\n<p>We are going to be using Github actions to establish a connection from our private repository to a separate, public repository. To make this easier, we need to make the following secrets in our private repository:</p>\n<ul>\n<li><strong>PUBLII_PUBLIC_BRANCH</strong><br>I wrote this while Github was transitioning default branches from <em>master</em> to <em>main</em>. Some actions still default to master, so this is for convenience in case you want to call your default branch something other than master.</li>\n<li><strong>PUBLII_PUBLIC_REPO</strong><br>This is the name of our second repository. Be sure to include your user or organization name (e.g. tfowles/blog-public)</li>\n<li><strong>PUBLII_PUBLIC_TOKEN</strong><br>This is a token for your user that will allow you to access the second repository. For more details on how to set this up, <a href=\"https://getpublii.com/docs/host-static-website-github-pages.html\" target=\"_blank\" rel=\"noopener noreferrer\">refer to <em>Generating an access token</em> on this page</a>.</li>\n</ul>\n<h5>Create Github Actions File</h5>\n<p>In the private repository, create a file: <strong>.github &gt; workflows &gt; publish-release.yml</strong></p>\n<pre>name: Publish Release<br>on:<br>  release:<br>    types: [published]<br><br>jobs:<br>  build-artifact:<br>    runs-on: ubuntu-latest<br>    steps:<br>      <br>      - name: Checkout default branch<br>        uses: actions/checkout@v2<br>        with:<br>          path: publii-private<br>          persist-credentials: false # otherwise, the token used is the GITHUB_TOKEN, instead of your personal token<br>          fetch-depth: 0 # otherwise, you will failed to push refs to dest repo<br>      <br>      - name: Add nojekyll file<br>        run: touch publii-private/output/.nojekyll<br>        <br>      - name: Build artifact  <br>        uses: actions/upload-artifact@v2<br>        with:<br>          name: website-content<br>          path: publii-private/output/<br>          <br>      - name: Checkout public repo<br>        uses: actions/checkout@v2<br>        with:<br>          repository: ${{ secrets.PUBLII_PUBLIC_REPO }}<br>          path: publii-public<br>          persist-credentials: false # otherwise, the token used is the GITHUB_TOKEN, instead of your personal token<br>          fetch-depth: 0 # otherwise, you will failed to push refs to dest repo<br>          <br>      - name: Empty the repository<br>        run: |<br>            cd publii-public<br>            git rm -rf .<br>            git clean -fxd<br>            cd ..<br><br>      - name: Download artifact<br>        uses: actions/download-artifact@v2<br>        with:<br>          name: website-content<br>          path: publii-public/<br>          <br>      - name: Commit and push<br>        uses: actions-js/push@v1.2<br>        with:<br>          github_token: ${{ secrets.PUBLII_PUBLIC_TOKEN }}<br>          repository: ${{ secrets.PUBLII_PUBLIC_REPO }}<br>          branch: ${{ secrets.PUBLII_PUBLIC_BRANCH }}<br>          directory: publii-public<br>          # Allow empty commit<br>          force: true</pre>\n<p>Save the file and merge it into the default branch.</p>\n<h5>Pushing Website Changes</h5>\n<p>To move data from the Output folder over to the public repository, all you need to do is publish a release. I like this, as I can make a number of changes within the private repository, and multiple authors can view and work off of these changes, but nothing needs to get pushed out to the actual website.</p>\n<p>To publish changes to the website, simply create a release at Github.com. Be sure to publish the release. Once the release is published, the action will kick off and in just a couple of minutes the changes will be live on your website.</p>\n<h3>Conclusion</h3>\n<p>...And that's all. Pretty simple right? It would be nice if it was built into the Publii system to do all of this. But it's not too hard to get setup, and once its in place, you shouldn't have to touch it again. Now I can create blog posts so fast and have all the collaborators (on my personal blog) check my work and let me know what they would change before we make it live. But I do think it is pretty cool that I can have content controls on my Publii blog using common git flows (i.e. in my case, creating release to make changes to my live website).</p>\n<p>Good luck!</p>",
            "image": "https://blog.thomasfowles.com/media/posts/3/publii-cms-cropped.png",
            "author": {
                "name": "Thomas Fowles"
            },
            "tags": [
            ],
            "date_published": "2020-10-06T22:45:54-06:00",
            "date_modified": "2020-10-12T23:10:23-06:00"
        }
    ]
}
